package Tasks;

public class HW7 {

//    Делать код ревью порой не проще, чем писать сам код. А то и сложнее. Давайте попробуем? Вашей задачей будет изучить код и описать на своей страничке гугл-дока - для чего он замышлялся и что должен делать.
//    Код написан на придуманном языке программирования, но по примерно общим правилам.
//    class Helper {
//        public helper(STRING str, INT maxLen, STRING end) -> STRING {
//            if (str.length < maxLen) {
//                return str
//            }
//
//            STRING[] split = str.split(" ");
//            STRING newStr = ""
//
//            for (String strPart IN split) {
//                if (newStr.length > maxLen) {
//                    break
//                }
//
//                newStr += strPart
//            }
//            newStr += end
//            return newStr
//        }
//    }
//
//    Функция получает на вход строку, число и еще одну строку. Что-то делает и возвращает строку. Вопрос - что он делает :)

/*
    Функция проверяет размер входящей строки и если он меньше чем максимальный возвращает эту строку,
    Если больше то выполняет следующие манипуляции, разбивает строку на слова, создает новую строку и добавляет к ней по одному слову
    пока длина новой строки не привысит максимальное значение. В этом случае функция добавляет к новой строке окончение end и возвращает ее.
 */
}
